23.07.2022г.

ДЗ 
Урок 2. Вычисления с помощью Numpy. Работа с данными в Pandas.

Тамбовцев Р.

Тема “Вычисления с помощью Numpy”

# Задание 1

Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [2]:
import numpy as np

In [38]:
a = np.array([[1, 2, 3, 3, 1], 
             [6, 8, 11, 10, 7]]).T
print(a)
print(a.size)
print(a.ndim)
print(a.shape)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
10
2
(5, 2)

In [39]:
a_mean = np.mean(a, axis=0)
print('Среднее значение по признакам составляет: {}'.format(a_mean))

Среднее значение по признакам составляет: [2.  8.4]

# Задание 2

Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2

In [40]:
a_centered = np.subtract(a, a_mean)
print(a_centered)
print(a_centered.shape)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]
(5, 2)

# Задание 3

Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [45]:
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])

In [46]:
print(a_centered_sp)

8.0

In [53]:
N = len(a)
b = a_centered_sp / (N - 1)
print(b)

2.0

# Задание 4**

Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.

Подробнее узнать о ковариации можно здесь:
Выборочная ковариация и выборочная дисперсия — Студопедия

В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [55]:
check_cov = np.cov((a).T)
print(check_cov)

[[1.  2. ]
 [2.  4.3]]

Элемент в строке с индексом "0" и столбце с индексом "1" принимает значение - 2

# Тема “Работа с данными в Pandas”

# Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],

['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

[450, 300, 350, 500, 450, 370, 290].

In [4]:
import pandas as pd

In [5]:
data = {
    "authors_id": [1, 2, 3],
    "authors_name": ['Тургенев', 'Чехов', 'Островский']
}

In [6]:
authors = pd.DataFrame(data)
authors

   authors_id authors_name
0           1     Тургенев
1           2        Чехов
2           3   Островский

In [7]:
books = pd.DataFrame({
    "authors_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price" : [450, 300, 350, 500, 450, 370, 290]
})

In [8]:
books

   authors_id            book_title  price
0           1           Отцы и дети    450
1           1                 Рудин    300
2           1     Дворянское гнездо    350
3           2      Толстый и тонкий    500
4           2       Дама с собачкой    450
5           3                 Гроза    370
6           3  Таланты и поклонники    290

# Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [9]:
authors_price = pd.merge(authors, books, on='authors_id', how='left')
authors_price

   authors_id authors_name            book_title  price
0           1     Тургенев           Отцы и дети    450
1           1     Тургенев                 Рудин    300
2           1     Тургенев     Дворянское гнездо    350
3           2        Чехов      Толстый и тонкий    500
4           2        Чехов       Дама с собачкой    450
5           3   Островский                 Гроза    370
6           3   Островский  Таланты и поклонники    290

# Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [10]:
top5 = authors_price.nlargest(5, "price")
top5

   authors_id authors_name         book_title  price
3           2        Чехов   Толстый и тонкий    500
0           1     Тургенев        Отцы и дети    450
4           2        Чехов    Дама с собачкой    450
5           3   Островский              Гроза    370
2           1     Тургенев  Дворянское гнездо    350

# Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [101]:
authors_price['max_price'] = authors_price.groupby(["authors_id"], sort=False)["price"].transform('max')
authors_price['min_price'] = authors_price.groupby(["authors_id"], sort=False)["price"].transform('min')
authors_price['mean_price'] = authors_price.groupby(["authors_id"], sort=False)["price"].transform('mean').round(2)
authors_price

,authors_id,authors_name,book_title,price,max_price,min_price,mean_price
0,1,Тургенев,Отцы и дети,450,450,300,366.67
1,1,Тургенев,Рудин,300,450,300,366.67
2,1,Тургенев,Дворянское гнездо,350,450,300,366.67
3,2,Чехов,Толстый и тонкий,500,500,450,475.00
4,2,Чехов,Дама с собачкой,450,500,450,475.00
5,3,Островский,Гроза,370,370,290,330.00
6,3,Островский,Таланты и поклонники,290,370,290,330.00

In [102]:
authors_stat = authors_price[["authors_name", "max_price", "min_price", "mean_price"]]
authors_stat = authors_stat.groupby("authors_name")
authors_stat.first()

              max_price  min_price  mean_price
authors_name
Островский          370        290      330.00
Тургенев            450        300      366.67
Чехов               500        450      475.00